:PROPERTIES:
:ID: 61B7F668-5B49-4470-9C52-4BC547E3AB4F
:END:
#+title: Delete Feature Flag
#+description: Delete Feature Flag
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:variability:
#+created: 2026-05-21
#+updated: 2026-05-21

Delete a feature flag by name.

#+name: delete-feature-flag
#+begin_src ores-shell :exports none
variability delete-flag test.feature.flag
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args}  << 'EOF'
<<delete-feature-flag>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
  Tenant: System (00000000-0000-0000-0000-000000000000)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Feature flag deleted successfully!
ores-shell> Bye!
#+end_example
